{
    "common": {
        "name": "sourceanalytix",
        "version": "0.4.7",
        "news": {
            "0.4.7": {
                "en": "Implement Sentry\nImplement configuration for Price definitions\nBugfix: NULL value issue  at daily reset\nBugfix: Issue found in selection of category\nBugfix: Category issue (read value of undefined)\nBugfix: Issue in storing meter values by month\nBugfix: Wrong reading value for Watt initialisation\nBugfix: Warnings at object creations (js-controller 3.x)\nBugfix: wrong interpretation of start values at value resets\nBugfix: Proper error message instead of code crash if no cost type defined\nAdd device name for log messages if device value < than currently known value\nBugfix : Crash at adapter start if chosen Type is not present in instance configuration",
                "de": "Implementieren Sie Sentry\nImplementieren Sie die Konfiguration für Preisdefinitionen\nBugfix: NULL-Wert-Problem beim täglichen Zurücksetzen\nBugfix: Problem bei der Auswahl der Kategorie gefunden\nBugfix: Kategorieproblem (Lesewert von undefined)\nBugfix: Problem beim Speichern von Zählerwerten nach Monat\nBugfix: Falscher Lesewert für Watt-Initialisierung\nBugfix: Warnungen bei Objekterstellung (js-controller 3.x)\nBugfix: Falsche Interpretation von Startwerten beim Zurücksetzen von Werten\nBugfix: Richtige Fehlermeldung statt Code-Absturz, wenn kein Kostentyp definiert ist\nFügen Sie den Gerätenamen für Protokollnachrichten hinzu, wenn der Gerätewert <als der derzeit bekannte Wert ist\nBugfix: Absturz beim Adapterstart, wenn der ausgewählte Typ in der Instanzkonfiguration nicht vorhanden ist",
                "ru": "Реализовать Sentry\nВнедрить конфигурацию для определения цены\nИсправление: проблема с нулевым значением при ежедневном сбросе\nИсправление: ошибка при выборе категории\nИсправление: проблема с категорией (значение чтения undefined)\nИсправление: проблема с сохранением значений счетчика по месяцам.\nИсправление: неверное значение чтения для инициализации ватт\nИсправление: предупреждения при создании объекта (js-controller 3.x)\nИсправление: неправильная интерпретация начальных значений при сбросе значений\nИсправление: правильное сообщение об ошибке вместо сбоя кода, если тип стоимости не определен\nДобавить имя устройства для сообщений журнала, если значение устройства <текущего известного значения\nИсправление: сбой при запуске адаптера, если выбранный тип отсутствует в конфигурации экземпляра",
                "pt": "Implementar Sentinela\nImplementar configuração para definições de preço\nCorreção: problema de valor NULL na redefinição diária\nCorreção: problema encontrado na seleção da categoria\nCorreção de bug: problema de categoria (leia o valor de indefinido)\nCorreção: problema no armazenamento de valores do medidor por mês\nCorreção: valor de leitura errado para inicialização de Watt\nCorreção de bug: Avisos na criação de objetos (js-controller 3.x)\nCorreção: interpretação errada dos valores iniciais nas redefinições de valor\nCorreção de bug: mensagem de erro adequada em vez de falha de código se nenhum tipo de custo definido\nAdicione o nome do dispositivo para mensagens de log se o valor do dispositivo <do que o valor atualmente conhecido\nCorreção de bug: falha no início do adaptador se o tipo escolhido não estiver presente na configuração da instância",
                "nl": "Implementeer Sentry\nImplementeer configuratie voor prijsdefinities\nBugfix: probleem met NULL-waarde bij dagelijkse reset\nBugfix: probleem gevonden in selectie van categorie\nBugfix: Category issue (lees waarde van undefined)\nBugfix: probleem bij het opslaan van meterwaarden per maand\nBugfix: verkeerde leeswaarde voor Watt-initialisatie\nBugfix: waarschuwingen bij objectcreaties (js-controller 3.x)\nBugfix: verkeerde interpretatie van startwaarden bij resets van waarden\nBugfix: Juiste foutmelding in plaats van code crash als er geen kostentype is gedefinieerd\nVoeg een apparaatnaam toe voor logboekberichten als de apparaatwaarde <de momenteel bekende waarde is\nBugfix: Crash bij het starten van de adapter als het gekozen Type niet aanwezig is in de instantieconfiguratie",
                "fr": "Mettre en œuvre Sentry\nImplémenter la configuration des définitions de prix\nCorrectif: problème de valeur NULL lors de la réinitialisation quotidienne\nCorrection de bug: problème trouvé dans la sélection de la catégorie\nCorrectif: problème de catégorie (lecture de la valeur non définie)\nCorrection de bug: problème de stockage des valeurs de compteur par mois\nCorrectif: valeur de lecture incorrecte pour l'initialisation des watts\nCorrectif: avertissements lors de la création d'objets (js-controller 3.x)\nCorrection de bug: mauvaise interprétation des valeurs de départ lors de la réinitialisation des valeurs\nCorrectif: message d'erreur correct au lieu d'un crash de code si aucun type de coût n'est défini\nAjouter un nom de périphérique pour les messages de journal si la valeur de périphérique <que la valeur actuellement connue\nCorrectif: Crash au démarrage de l'adaptateur si le type choisi n'est pas présent dans la configuration de l'instance",
                "it": "Implementa Sentry\nImplementare la configurazione per le definizioni dei prezzi\nBugfix: problema di valore NULL durante il ripristino giornaliero\nBugfix: problema riscontrato nella selezione della categoria\nBugfix: problema di categoria (valore letto di undefined)\nBugfix: problema nella memorizzazione dei valori del contatore per mese\nErrore corretto: valore di lettura errato per l'inizializzazione Watt\nBugfix: avvisi durante la creazione di oggetti (js-controller 3.x)\nBugfix: interpretazione errata dei valori iniziali al ripristino dei valori\nBugfix: messaggio di errore corretto invece di crash del codice se non è stato definito alcun tipo di costo\nAggiungi il nome del dispositivo per i messaggi di registro se il valore del dispositivo <del valore attualmente noto\nErrore corretto: arresto anomalo all'avvio dell'adattatore se il tipo scelto non è presente nella configurazione dell'istanza",
                "es": "Implementar Sentry\nImplementar la configuración para las definiciones de precios\nCorrección de error: problema de valor NULO en el reinicio diario\nCorrección de error: problema encontrado en la selección de categoría\nCorrección de error: problema de categoría (valor de lectura de indefinido)\nCorrección de error: problema al almacenar los valores del medidor por mes\nCorrección de error: valor de lectura incorrecto para la inicialización de Watt\nCorrección de error: advertencias en la creación de objetos (js-controller 3.x)\nCorrección de error: interpretación incorrecta de los valores iniciales en el valor se restablece\nCorrección de errores: mensaje de error adecuado en lugar de bloqueo de código si no se define ningún tipo de costo\nAgregue el nombre del dispositivo para los mensajes de registro si el valor del dispositivo es <que el valor conocido actualmente\nCorrección de error: falla al inicio del adaptador si el tipo elegido no está presente en la configuración de la instancia",
                "pl": "Zaimplementuj Sentry\nZaimplementuj konfigurację dla definicji cen\nPoprawka: problem z wartością NULL przy codziennym resetowaniu\nPoprawka błędu: znaleziono problem w wyborze kategorii\nPoprawka: Problem z kategorią (odczyt wartości niezdefiniowanej)\nPoprawka: problem z przechowywaniem wartości liczników według miesięcy\nPoprawka: Błędna wartość odczytu dla inicjalizacji Watta\nPoprawka: ostrzeżenia przy tworzeniu obiektów (js-controller 3.x)\nPoprawka: nieprawidłowa interpretacja wartości początkowych przy resetowaniu wartości\nPoprawka: Właściwy komunikat o błędzie zamiast awarii kodu, jeśli nie zdefiniowano typu kosztu\nDodaj nazwę urządzenia dla komunikatów dziennika, jeśli wartość urządzenia jest mniejsza niż aktualnie znana wartość\nPoprawka: Awaria podczas uruchamiania adaptera, jeśli wybrany typ nie występuje w konfiguracji instancji",
                "zh-cn": "实施哨兵\n实施价格定义的配置\n错误修正：每日重置时出现NULL值问题\n错误修正：选择类别时发现问题\n错误修正：类别问题（读取值未定义）\n错误修正：按月存储仪表值时出现问题\n错误修正：瓦特初始化的读取值错误\n错误修正：对象创建时的警告（js-controller 3.x）\n错误修正：值重置时对起始值的错误解释\n错误修正：如果未定义成本类型，则正确的错误消息而不是代码崩溃\n如果设备值小于当前已知值，则添加日志消息的设备名称\n错误修正：如果实例配置中不存在所选类型，则适配器启动时会崩溃"
            },
            "0.4.2": {
                "en": "Bugfixes",
                "de": "Fehlerbehebung",
                "ru": "Исправление ошибок",
                "pt": "Correções de bugs",
                "nl": "Bugfixes",
                "fr": "Corrections de bugs",
                "it": "Correzioni di bug",
                "es": "Corrección de errores",
                "pl": "Poprawki błędów",
                "zh-cn": "Bug修复"
            },
            "0.4.0": {
                "en": "Adapter completely redesigned, please test carefully",
                "de": "Adapter komplett neu gestaltet, bitte sorgfältig testen",
                "ru": "Адаптер полностью переработан, пожалуйста, проверьте внимательно",
                "pt": "Adaptador completamente redesenhado, teste com cuidado",
                "nl": "Adapter volledig opnieuw ontworpen, test zorgvuldig",
                "fr": "Adaptateur entièrement repensé, veuillez tester soigneusement",
                "it": "Adattatore completamente riprogettato, si prega di testare attentamente",
                "es": "Adaptador completamente rediseñado, por favor pruebe cuidadosamente",
                "pl": "Adapter całkowicie przeprojektowany, proszę przetestować dokładnie",
                "zh-cn": "适配器完全重新设计，请仔细测试"
            },
            "0.3.0": {
                "en": "m³ Implemented",
                "de": "m³ umgesetzt",
                "ru": "м³ Реализовано",
                "pt": "m³ implementado",
                "nl": "m³ geïmplementeerd",
                "fr": "m³ mis en œuvre",
                "it": "m³ Implementato",
                "es": "m³ Implementado",
                "pl": "m³ Wdrożony",
                "zh-cn": "已实施m³"
            },
            "0.2.5": {
                "en": "Fix wrong storage of start meter values, thank you xXBJXx",
                "de": "Fehler beim Speichern der Startzählerwerte behoben, danke xXBJXx",
                "ru": "Исправьте неправильное хранение значений стартового счетчика, спасибо xXBJXx",
                "pt": "Corrigir o armazenamento errado dos valores do medidor inicial, obrigado xXBJXx",
                "nl": "Herstel verkeerde opslag van startmeterwaarden, bedankt xXBJXx",
                "fr": "Correction du mauvais stockage des valeurs initiales du compteur, merci xXBJXx",
                "it": "Correggi l'archiviazione errata dei valori del misuratore di avvio, grazie xXBJXx",
                "es": "Arregle el almacenamiento incorrecto de los valores de inicio del medidor, gracias xXBJXx",
                "pl": "Napraw nieprawidłowe przechowywanie początkowych wartości liczników, dziękuję xXBJXx",
                "zh-cn": "修复了启动仪表值的错误存储，谢谢xXBJXx"
            },
            "0.2.41": {
                "en": "Calculation w to kWh implemented & several code improvements",
                "de": "Berechnung w bis kWh implementiert & mehrere Code-Verbesserungen",
                "ru": "Выполнен расчет с использованием кВтч и несколько улучшений кода",
                "pt": "Cálculo w para kWh implementado e várias melhorias de código",
                "nl": "Berekening w tot kWh geïmplementeerd & verschillende codeverbeteringen",
                "fr": "Calcul w en kWh mis en œuvre & plusieurs améliorations de code",
                "it": "Calcolo w in kWh implementato e numerosi miglioramenti del codice",
                "es": "Cálculo w a kWh implementado y varias mejoras de código.",
                "pl": "Wprowadzono obliczenia w do kWh i wprowadzono kilka ulepszeń kodu",
                "zh-cn": "计算w到kWh实施和几个代码改进"
            },
            "0.2.27": {
                "en": "Fixed issue related to multihost installations with slave as target",
                "de": "Problem bei Multihost-Installationen mit Slave als Ziel behoben",
                "ru": "Исправлена ​​проблема, связанная с установкой нескольких хостов с ведомым в качестве цели",
                "pt": "Corrigido problema relacionado a instalações multi-host com escravo como alvo",
                "nl": "Probleem opgelost met multihost-installaties met slaaf als doelwit",
                "fr": "Résolution du problème lié aux installations multihôtes avec esclave comme cible",
                "it": "Risolto il problema relativo alle installazioni multihost con slave come destinazione",
                "es": "Se solucionó el problema relacionado con las instalaciones multihost con esclavo como destino",
                "pl": "Naprawiono problem związany z instalacjami multihost z niewolnikiem jako celem",
                "zh-cn": "修复了与slave作为目标的多主机安装相关的问题"
            },
            "0.2.26": {
                "en": "Fix issue in calculations for gas environments and liquids",
                "de": "Problem in Berechnungen für Gasumgebungen und Flüssigkeiten behoben",
                "ru": "Исправлена ​​ошибка в расчетах для газовых сред и жидкостей.",
                "pt": "Corrigir problema em cálculos para ambientes de gás e líquidos",
                "nl": "Probleem verhelpen bij berekeningen voor gasomgevingen en vloeistoffen",
                "fr": "Correction d'un problème dans les calculs pour les environnements de gaz et les liquides",
                "it": "Risolto il problema nei calcoli per ambienti a gas e liquidi",
                "es": "Solucionar el problema en los cálculos para ambientes de gas y líquidos.",
                "pl": "Napraw problem w obliczeniach dla środowisk gazowych i cieczy",
                "zh-cn": "解决气体环境和液体计算中的问题"
            },
            "0.2.25": {
                "en": "add option in state setting to automatically OR manually choose the meassurement unit",
                "de": "Option in Zustandseinstellung hinzufügen, um die Maßeinheit automatisch ODER manuell auszuwählen",
                "ru": "добавить опцию в настройке состояния, чтобы автоматически или вручную выбрать единицу измерения",
                "pt": "adicione a opção na configuração de estado para automaticamente OU escolha manualmente a unidade de medida",
                "nl": "optie toevoegen in de statusinstelling om automatisch of handmatig de meeteenheid te kiezen",
                "fr": "ajout d'option dans le réglage d'état pour choisir automatiquement OU manuellement l'unité de mesure",
                "it": "aggiungere l'opzione nell'impostazione dello stato automaticamente O selezionare manualmente l'unità di misura",
                "es": "Agregue la opción en la configuración de estado para seleccionar automáticamente O manualmente la unidad de medida",
                "pl": "dodać opcję w ustawieniu stanu, aby automatycznie LUB ręcznie wybrać jednostkę miary",
                "zh-cn": "在状态设置中添加选项以自动或手动选择测量单位"
            },
            "0.2.24": {
                "en": "add support for heating pumps",
                "de": "Unterstützung für Heizungspumpen hinzufügen",
                "ru": "добавить поддержку для тепловых насосов",
                "pt": "adicione suporte para bombas de aquecimento",
                "nl": "voeg ondersteuning toe voor verwarmingspompen",
                "fr": "ajouter un support pour les pompes à chaleur",
                "it": "aggiungere il supporto per le pompe di calore",
                "es": "añadir soporte para bombas de calor",
                "pl": "dodaj wsparcie dla pomp grzewczych",
                "zh-cn": "增加对加热泵的支持"
            },
            "0.2.2": {
                "en": "Final fix for start values, several code improvements",
                "de": "Endfix für Startwerte, verschiedene Code-Verbesserungen",
                "ru": "Окончательное исправление для начальных значений, несколько улучшений кода",
                "pt": "Correção final para valores iniciais, várias melhorias no código",
                "nl": "Laatste fix voor startwaarden, verschillende codeverbeteringen",
                "fr": "Correctif final pour les valeurs de départ, plusieurs améliorations de code",
                "it": "Correzione finale per i valori iniziali, diversi miglioramenti del codice",
                "es": "Arreglo final para valores de inicio, varias mejoras de código",
                "pl": "Ostateczna poprawka wartości początkowych, kilka ulepszeń kodu",
                "zh-cn": "0.2.2起始值的最终修复，几个代码改进"
            },
            "0.2.1": {
                "en": "Several bugs fixed",
                "de": "Mehrere Fehler behoben",
                "ru": "Исправлено несколько ошибок",
                "pt": "Vários bugs corrigidos",
                "nl": "Verschillende bugs verholpen",
                "fr": "Plusieurs bugs corrigés",
                "it": "Diversi errori risolti",
                "es": "Varios errores corregidos",
                "pl": "Naprawiono kilka błędów",
                "zh-cn": "修复了几个错误"
            },
            "0.2.0": {
                "en": "Public Release candidate",
                "de": "Öffentlicher Release-Kandidat",
                "ru": "Публичный релиз кандидата",
                "pt": "Candidato de lançamento público",
                "nl": "Public Release-kandidaat",
                "fr": "Candidat à la diffusion publique",
                "it": "Candidato a rilascio pubblico",
                "es": "Candidato de lanzamiento público",
                "pl": "Kandydat na Public Release",
                "zh-cn": "公开发布候选人"
            }
        },
        "title": "SourceAnalytix",
        "titleLang": {
            "en": "SourceAnalytix",
            "de": "SourceAnalytix",
            "ru": "SourceAnalytix",
            "pt": "SourceAnalytix",
            "nl": "SourceAnalytix",
            "fr": "SourceAnalytix",
            "it": "SourceAnalytix",
            "es": "SourceAnalytix",
            "pl": "SourceAnalytix",
            "zh-cn": "SourceAnalytix"
        },
        "desc": {
            "en": "Detailed statistics of your energy, gas and liquid consumption. Allows annual report and details according to weekly, monthly and quarterly consumption data.",
            "de": "Detaillierte Statistiken Ihres Energie-, Gas- und Flüssigkeitsverbrauchs. Ermöglicht Jahresberichte und Details gemäß wöchentlichen, monatlichen und vierteljährlichen Verbrauchsdaten.",
            "ru": "Подробная статистика вашего потребления энергии, газа и жидкости. Позволяет годовой отчет и подробную информацию в соответствии с еженедельными, ежемесячными и квартальными данными потребления.",
            "pt": "Estatísticas detalhadas de seu consumo de energia, gás e líquido. Permite relatório anual e detalhes de acordo com dados de consumo semanais, mensais e trimestrais.",
            "nl": "Gedetailleerde statistieken van uw energie-, gas- en vloeistofverbruik. Staat jaarverslag en details toe op basis van wekelijkse, maandelijkse en driemaandelijkse verbruiksgegevens.",
            "fr": "Statistiques détaillées de votre consommation d'énergie, de gaz et de liquide. Permet un rapport annuel et des détails selon les données de consommation hebdomadaires, mensuelles et trimestrielles.",
            "it": "Statistiche dettagliate sul consumo di energia, gas e liquidi. Consente report e dettagli annuali in base ai dati di consumo settimanali, mensili e trimestrali.",
            "es": "Estadísticas detalladas de su consumo de energía, gas y líquido. Permite informes anuales y detalles según datos de consumo semanal, mensual y trimestral.",
            "pl": "Szczegółowe statystyki zużycia energii, gazu i cieczy. Umożliwia raport roczny i szczegóły zgodnie z tygodniowymi, miesięcznymi i kwartalnymi danymi dotyczącymi zużycia.",
            "zh-cn": "您的能源，气体和液体消耗的详细统计信息。允许根据每周，每月和每季度的消费数据提供年度报告和详细信息。"
        },
        "authors": [
            "DutchmanNL <rdrozda86@gmail.com>"
        ],
        "contributors": [
            "xXBJXx"
        ],
        "keywords": [
            "energy",
            "power",
            "analytics",
            "consumption",
            "meassurement",
            "data"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "sourceanalytix.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.sourceanalytix/master/admin/sourceanalytix.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.sourceanalytix/blob/master/README.md",
        "loglevel": "warn",
        "mode": "daemon",
        "type": "energy",
        "compact": true,
        "materialize": true,
        "plugins": {
            "sentry": {
                "dsn": "https://2cd80ab3d4b94677b1b513547054e480@sentry.iobroker.net/24"
            }
        },
        "supportCustoms": true,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=1.4.2"
            }
        ]
    },
    "native": {
        "pricesDefinition": [
            {
                "cat": "ElectricityDay",
                "des": "Electricity consumption Day price",
                "costType": "costs",
                "unitType": "kWh",
                "uPpU": "0.27",
                "uPpM": "15"
            },
            {
                "cat": "ElectricityDelivery",
                "des": "Electricity Delivery Earnings",
                "costType": "earnings",
                "unitType": "kWh",
                "uPpU": "0.17",
                "uPpM": "15"
            },
            {
                "cat": "ElectricityNight",
                "des": "Electricity consumption Night price",
                "costType": "costs",
                "unitType": "kWh",
                "uPpU": "0.24",
                "uPpM": "15"
            },
            {
                "cat": "Heatpump",
                "des": "Heatpomp costs by unit",
                "costType": "costs",
                "unitType": "kWh",
                "uPpU": "0.24",
                "uPpM": "31"
            },
            {
                "cat": "Gas",
                "des": "Gas costs by unit",
                "costType": "costs",
                "unitType": "m³",
                "uPpU": "0.12",
                "uPpM": "31"
            },
            {
                "cat": "Oil",
                "des": "Oil costs by unit",
                "costType": "costs",
                "unitType": "m³",
                "uPpU": "0.12",
                "uPpM": "7.38"
            },
            {
                "cat": "Water",
                "des": "Water costs by unit",
                "costType": "costs",
                "unitType": "m³",
                "uPpU": "0.07",
                "uPpM": "22"
            }
        ],
        "store_days": true,
        "store_weeks": false,
        "store_months": true,
        "store_quarters": false,
        "store_years": false,
        "store_period": false,
        "keep_days": 7,
        "keep_weeks": 4,
        "keep_quarters": 2,
        "keep_months": 4,
        "keep_years": 1,
        "impuls": 400,
        "status_logging": false
    },
    "objects": [
        {
            "_id": "_design/custom",
            "language": "javascript",
            "views": {
                "state": {
                    "map": "function(doc) { if (doc.type === 'state' && (doc.common.custom || doc.common.history)) emit(doc._id, doc.common.custom || doc.common.history) }"
                }
            }
        }
    ],
    "instanceObjects": []
}